1.
duration = 47
print(duration, 'сек')
duration = 198
print(198 // 60, 'мин', 198 % 60, 'сек')
duration = 5346
print(5346 // 60 // 60, 'час', 5346 // 60 % 60, 'минут', 5346 % 60, 'секунд')


duration = 500786
print(500786//60//60//24, 'дней', 500786//60//60%60, 'часов', 500786//60%60, 'минут', 500786%60, 'секунд')


2.
my_list = []
for i in range(1001):
    i != 0
    i += i % 10
    i //10


3.

i = input('Введите проценты:  ')
a = ('Процент')
b = ('Процента')
b = ('Процентов')


